/*

#include <iostream>

int main()
{

    // Задание 1
    //Октябрь уж наступил — уж роща отряхает
    //Последние листы с нагих своих ветвей;
    //Дохнул осенний хлад — дорога промерзает.
    //Журча еще бежит за мельницу ручей,
    //Но пруд уже застыл; сосед мой поспешает
    //В отъезжие поля с охотою своей,
    //И страждут озими от бешеной забавы,
    //И будит лай собак уснувшие дубравы.


    //У меня кодировка не работает русская, поэтому на английский перевел стих
    

    
    std::cout << "October has already come — the grove is shaking off\n";
    std::cout << "The last leaves from their naked branches;\n";
    std::cout << "The autumn chill has died — the road is freezing.\n";
    std::cout << "The stream is still running behind the mill,\n";
    std::cout << "But the pond has already frozen; my neighbor is hurrying\n";
    std::cout << "To the outgoing fields with his hunting,\n";
    std::cout << "And the winter is suffering from frenzied fun,\n";
    std::cout << "And the barking of dogs wakes up the sleeping oak forests.\n";
    std::cout << "\t\t\t\t\tA.S.Pushkin in English.";
    

    // Задание 2

    // Every hunter wants to know where does pheasant sit
    
    std::cout << "Every\n";
    std::cout << "\thunter\n";
    std::cout << "\t\twants\n";
    std::cout << "\t\t\tto know\n";
    std::cout << "\t\t\t\twhere\n";
    std::cout << "\t\t\t\t\tdoes pheasant\n";
    std::cout << "\t\t\t\t\t\t\tsit\n";
    

    // Задание 3

    std::cout << "\t\t\t\t\tsale of phones\n";
    std::cout << "\t\t\t\t\thonor phone\n";
    std::cout << "\t\t\t\t\tMobile Telephon: 848-77-23\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";

    return 0;
}
*/
/*
#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian"); // русская кодировка


}
*/