/*
#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian"); // русская кодировка
    // Задание 1
    //Октябрь уж наступил — уж роща отряхает
    //Последние листы с нагих своих ветвей;
    //Дохнул осенний хлад — дорога промерзает.
    //Журча еще бежит за мельницу ручей,
    //Но пруд уже застыл; сосед мой поспешает
    //В отъезжие поля с охотою своей,
    //И страждут озими от бешеной забавы,
    //И будит лай собак уснувшие дубравы.

    std::cout << "Октябрь уж наступил — уж роща отряхает\n";
    std::cout << "Последние листы с нагих своих ветвей;\n";
    std::cout << "Дохнул осенний хлад — дорога промерзает.\n";
    std::cout << "Журча еще бежит за мельницу ручей,\n";
    std::cout << "Но пруд уже застыл; сосед мой поспешает\n";
    std::cout << "В отъезжие поля с охотою своей,\n";
    std::cout << "И страждут озими от бешеной забавы,\n";
    std::cout << "И будит лай собак уснувшие дубравы.\n";
    std::cout << "\t\t\t\t\tА.С Пушкин";

    // Задание 2
    // Every hunter wants to know where does pheasant sit

    std::cout << "Every\n";
    std::cout << "\thunter\n";
    std::cout << "\t\twants\n";
    std::cout << "\t\t\tto know\n";
    std::cout << "\t\t\t\twhere\n";
    std::cout << "\t\t\t\t\tdoes pheasant\n";
    std::cout << "\t\t\t\t\t\t\tsit\n";

    // Задание 3

    std::cout << "\t\t\t\t\tПродам щенков\n";
    std::cout << "\t\t\t\t\tПорода: ротвейлер.\n";
    std::cout << "\t\t\t\t\tМобильный телефон: 848-77-23\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";
    std::cout << "\t\t\t\t\t848\t|77-23|\n";

    return 0;
}
*/